Catalogs/Подъезды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Подъезды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПервойКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоследнейКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодъезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСооружений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСооружений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паркинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общежитие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаЗданий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Подъезды/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НомерПодъездаПриИзменении(Элемент)
	
	Если Объект.Вид = "Подъезд" Тогда
		Объект.Наименование = "Подъезд № " + Объект.НомерПодъезда + Объект.Суффикс;
	Иначе
		Объект.Наименование = "Секция № " + Объект.НомерПодъезда + Объект.Суффикс;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуффиксПриИзменении(Элемент)
	Если Объект.Вид = "Подъезд" Тогда
		Объект.Наименование = "Подъезд № " + Объект.НомерПодъезда + Объект.Суффикс;
	Иначе
		Объект.Наименование = "Секция № " + Объект.НомерПодъезда + Объект.Суффикс;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
		Объект.Наименование = Элементы.Вид.ТекстРедактирования + " № " + Объект.НомерПодъезда + Объект.Суффикс;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Улица (создание)';uk='Вулиця (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
		КонецЕсли;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Улица (создание)';uk='Вулиця (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		Элементы.Вид.Видимость = Ложь;
		Элементы.Суффикс.Видимость = Ложь;
		Элементы.НомерПодъезда.Видимость = Ложь;
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		Элементы.Наименование.Видимость = Ложь;
		
		Элементы.Владелец.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='по';uk='по'");
		
		Элементы.Владелец.Подсказка = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='по';uk='по'");
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		Элементы.Вид.Видимость = Ложь;
		Элементы.Суффикс.Видимость = Ложь;
		Элементы.НомерПодъезда.Видимость = Ложь;
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		Элементы.Наименование.Видимость = Ложь;
		
		Элементы.Владелец.Заголовок = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='по';uk='по'");
		
		Элементы.Владелец.Подсказка = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='по';uk='по'");
		
	Иначе
		Элементы.Наименование1.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()
